app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
---
INSERT INTO "comments" ("user_name", "body", "idea_id", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_name", "test"], ["body", "test"], ["idea_id", 1], ["picture", "95.jpg"], ["created_at", "2016-04-03 04:03:07.858329"], ["updated_at", "2016-04-03 04:03:07.858329"]]